**free

/include 'qcpysrc/logger'
/include 'qcpysrc/testmod'



dcl-s l_count   int(10);

  dcl-ds test_ds            extname('TEST') qualified;
  END-DS;
  
/copy 'qcpysrc/errhdlsql'

  test_ds.text = 'Test';
  test_ds.chgtime = %timestamp();

  exec sql insert into test (text, chgtime) values(:test_ds.text, :test_ds.chgtime);


// Just to test a procedure call is possible
testmod();

exec sql select count(*) Into :l_count from logger;
logdebug('Number of records: ' + %char(l_count) : 'LOG_TEST_CASE_2');

logerror('Just a jocke, it was not an error :-)' : 'LOG_TEST_CASE_2');


return;
